tk20dk/wally/stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define HDMI_HPD_EN_Pin GPIO_PIN_8
#define HDMI_HPD_EN_GPIO_Port GPIOB
#define I2C1_SDA_Pin GPIO_PIN_0
#define I2C1_SDA_GPIO_Port GPIOF
#define I2C1_SDA_EXTI_IRQn EXTI0_1_IRQn
#define I2C1_SCL_Pin GPIO_PIN_1
#define I2C1_SCL_GPIO_Port GPIOF
#define I2C1_SCL_EXTI_IRQn EXTI0_1_IRQn
#define HDMI_5V_IN_Pin GPIO_PIN_0
#define HDMI_5V_IN_GPIO_Port GPIOA
#define HDMI_HPD_IN_Pin GPIO_PIN_1
#define HDMI_HPD_IN_GPIO_Port GPIOA
#define HDMI_5V_EN_Pin GPIO_PIN_4
#define HDMI_5V_EN_GPIO_Port GPIOA
#define HDMI_CEC_IN_Pin GPIO_PIN_5
#define HDMI_CEC_IN_GPIO_Port GPIOA
#define LED_RED_Pin GPIO_PIN_6
#define LED_RED_GPIO_Port GPIOA
#define LED_GREEN_Pin GPIO_PIN_7
#define LED_GREEN_GPIO_Port GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
